import React, {useEffect, useState} from 'react';
import './App.css';
import 'materialize-css/dist/css/materialize.min.css';
import M from "materialize-css";
import { DefinitionList } from './components/DefinitionList/DefinitionList';
import { SerachFiled } from './components/SerachFiled/SerachFiled';

const dataTermsList = [
  {
    id:1,
    title: 'Мультимедіа',
    description: [
      {
        id:1,
        title:'комбінування різних форм представлення інформації на одному носієві, наприклад текстової, звукової і графічної, або, останнім часом все частіше — анімації і відео.',
      },
      {
        id:2,
        title:'програмний продукт, що містить зображення, текст і дані, які супроводжуються звуком, відео, анімацією і іншими візуальними ефектами, а також оснащений інтерактивним інтерфейсом з елементами управління',
      }
    ],
  },
  {
    id:2,
    title: 'Видання',
    description: [
      {
        id:1,
        title: 'документ, який пройшов редакційно-видавниче опрацювання, виготовлений друкуванням, тисненням або іншим способом, містить інформацію, призначену для поширення.',
      }
    ],
  },
  {
    id:3,
    title: 'Журнал',
    description: [
      {
        id:1,
        title: 'друковане періодичне видання. Журнал є одним з основних ЗМІ, впливає на громадську думку, формуючи її відповідно до інтересів певних ідеологічних груп, суспільних верств, політичних партій і організацій, наукових шкіл, конфесій, вікових, гендерних, специфічних прошарків соціуму.',
      }
    ],
  },
  {
    id:4,
    title: 'Палітурка',
    description: [
      {
        id:1,
        title: "цупка, захисна обкладинка книжки, зазвичай виготовлена з покритого з матерією картону, коленкору, важкого паперу, та рідше зі шкіри, з'єднана за допомогою подвійних аркушів паперу (форзаців) з книжковим блоком",
      }
    ],
  },
  {
    id:5,
    title: 'Браузер',
    description: [
      {
        id:1,
        title: "комп'ютерна програма для перегляду інформації в мережі Інтернет. Наприклад, Internet Explorer, Opera, Mozilla Firefox тощо",
      }
    ],
  },
  {
    id:6,
    title: 'Веб-вузол',
    description: [
      {
        id:1,
        title: "оєднання веб-сторінок, в загальну структуру. Окрім власне веб-сторінок, веб-вузол містить теги і файли, що забезпечують його функціонування в мережі Internet.",
      }
    ],
  },
  {
    id:7,
    title: 'Веб-сторінка',
    description: [
      {
        id:1,
        title: "це файл з розширенням HTM, HTML, SHTML, XHTML. Документ, який користувач одержує в результаті прочитування HTML-файлу спеціальною програмою — Web-оглядачем. Web-сторінка містить текст, графіку, а також посилання на інші документи і файли (текстові, графічні, аудіо і відео).",
      }
    ],
  },
  {
    id:8,
    title: 'Відеопроектори ',
    description: [
      {
        id:1,
        title: "проектори для роботи із джерелами аналогового відео сигналу у ТВ стандартах PAL, SECAM, NTSC (відеомагнітофони, телевізори, програвачі CD-I, DVD й ін.) через інтефейси S-Video.",
      }
    ],
  },
  {
    id:9,
    title: 'Гіперпосилання ',
    description: [
      {
        id:1,
        title: "це вказівка браузеру звернутися до даних або вказівок у мережах (або за межами) HTML — документа. За допомогою гіперпосилань користувачі можуть переходити з однієї сторінки на іншу, документ стає інтерактивним і динамічним.",
      }
    ],
  },
  {
    id:10,
    title: 'Гіпертекстуальність ',
    description: [
      {
        id:1,
        title: "насиченість середовища інформацією, організованість і зручність використання даного інформаційного середовища за допомогою спеціальних технологічних прийомів; таке навчально-пізнавальне середовище є відкритим з погляду доступу до інформаційних повідомлень і спілкування з іншими учасниками конференції.",
      }
    ],
  },
  {
    id:11,
    title: 'Домен ',
    description: [
      {
        id:1,
        title: "область, одиниця структури, певна зона в системі доменних імен Інтернету, виділена власникові домена (якій-небудь країні, міжнародній організації, регіону, юридичній або фізичній особі) для цілей забезпечення доступу до наданої в Інтернет інформації, що належить власнику домену.",
      }
    ],
  },
  {
    id:12,
    title: 'Інновація ',
    description: [
      {
        id:1,
        title: "створення та впровадження різного виду нововведень, які породжують значні зміни в освіті та інших галузях.",
      }
    ],
  },

];
export const App = () => {

  const [getData, setData] = useState([...dataTermsList])

  useEffect(() => {
      M.AutoInit();
  }, []);


  return (
    <div className="App">
      <SerachFiled getData={dataTermsList} setData={setData} />
      <ul className="collapsible">
        <DefinitionList dataTermsList={getData} />
      </ul>
    </div>
  )
}